//####Задача 7
//Сделайте функцию `getDivisors`, которая параметром принимает число и возвращает массив его делителей
//(чисел, на которое делится данное число начиная от 1 и заканчивая самим собой).
//Данная функция должна обязательно содержать проверку входного параметра, потому что принимать она может только число больше 0.

let getDivisors = (a) => {
    let arr = [];
    if (a >= 0) {
        for (let x = 1; x <= a; x++) {
            if (a % x == 0) {
                arr.push(x);
            }
        }
        return arr;
    } else {
        return "Переданный параметр меньше нуля.";
    }
};

console.log(getDivisors(126));
console.log(getDivisors(-21));
