//####Задача 8
//Дан массив с числами `[1, 2, 3]`. Создайте функцию `f`, которая принимает данный массив в качестве параметров, 
//а затем последовательно выводит на экран его элементы. Обязательно нужно использовать рекурсию. Использовать цикл запрещено. 
//Данная функция должна обязательно содержать проверку входного параметра, потому что принимать она может только не пустой массив.
//*Возможно вам понадобится метод [splice](https://developer.mozilla.org/uk/docs/Web/JavaScript/Reference/Global_Objects/Array/splice).*

let f = (a) => {
    if (a.length != 0) {
        console.log(a.shift());
        f(a);
    } else {
        console.log("Массив пуст");
    }
}

let mas = [1, 2, 3];
f(mas);
